//№1
//Дано число. Проверьте, отрицательное оно или нет. Выведите об этом информацию в консоль.
let a = 0;
if(a >= 0){
    console.log("Положительное!");
}
else{
    console.log("Отрицательное!");
}
//-----------------------------------------------------------------------------------------



//№2
//Дана строка. Выведите в консоль длину этой строки.
let b = "Hello world!";
console.log(b.length);
//-----------------------------------------------------------------------------------------



//№3
//Дана строка. Выведите в консоль последний символ строки.
let c = "Hehe";
let last = c.length - 1; // номер последнего символа
console.log(c[last]); // выведет 'e'
//-----------------------------------------------------------------------------------------



//№4
//Дано число. Проверьте, четное оно или нет.
const even = n => !(n % 2);

console.info(even(5));
console.info(even(4));
//-----------------------------------------------------------------------------------------



//№5
//Даны два слова. Проверьте, что первые буквы этих слов совпадают.

let d = "Hello";
let f = "Html";
if(d[1] = f[1]){
    console.log("Совпадают");
}
else{
    console.log("Не совпадают");
}
//-----------------------------------------------------------------------------------------



//№6
//Дано слово. Получите его последнюю букву. Если слово заканчивается на мягкий знак, то получите предпоследнюю букву.

let g = "жизнь";
let gLast = g.length - 1;
if(gLast == "ь"){
    console.log(g.length - 2);
}
else{
    console.log(gLast);
}
//-----------------------------------------------------------------------------------------



//№7
//Дано число. Выведите в консоль первую цифру этого числа.

let aa = 12345;
let aaa = aa.toString();
console.log(aaa[0]);
//-----------------------------------------------------------------------------------------



//№8
//Дано число. Выведите в консоль последнюю цифру этого числа.

let bb = 12345;
let bbb = bb.toString();
console.log(bbb[4]);
//-----------------------------------------------------------------------------------------



//№9
//Дано число. Выведите в консоль сумму первой и последней цифры этого числа.

let number = 12345;
let asd = number.toString();
console.log(+asd[0] + +asd[4]);
//-----------------------------------------------------------------------------------------



//№10
//Дано число. Выведите количество цифр в этом числе.

let A = 12356789;
let C = A.toString();
let B = C.length + 1;
console.log(B);
//-----------------------------------------------------------------------------------------


//№5
//Даны два числа. Проверьте, что первые цифры этих чисел совпадают.

let aaaaa = 10000;
let bbbbb = 1000;
let aaaa =
if(aaaa[0] = bbbb[0]){
    console.log("Совпадают");
}
else{
    console.log("Не совпадают");
}
